xslt.samples/resources/Welcome/WelcomeApplication/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:per="http://xml.netbeans.org/schema/Welcome">
  <soapenv:Body>
    <per:person>
      <per:name>William</per:name>
      <per:surname>Shakespeare</per:surname>
    </per:person>
  </soapenv:Body>
</soapenv:Envelope>
